# Clientes (continuação)

## 1 - Configuração do ambiente e base de dados de desenvolvimento

* Instalação do módulo jupysql

In [2]:
INSTALL = True
if INSTALL:
    %pip install jupysql --quiet

Note: you may need to restart the kernel to use updated packages.

* Carregamento da extensão *sql*

In [3]:
%load_ext sql

* Conexão à base base de dados(se não existir é criada):

In [4]:
%sql sqlite:///Exercicio_Clientes.sqlite

Connecting to 'sqlite:///Exercicio_Clientes.sqlite'

In [5]:
%config SqlMagic.displaylimit = 0
%sql PRAGMA foreign_keys = ON

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

++
||
++
++

In [6]:
%%sql
--
DROP TABLE IF EXISTS vendas;
DROP TABLE IF EXISTS produtos;
DROP TABLE IF EXISTS categorias;
DROP TABLE IF EXISTS fornecedores;
DROP TABLE IF EXISTS clientes;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

++
||
++
++

# 2 - Implementação do modelo de dados "Clientes"

## Tabela "Clientes"


a) Definição da tabela "Clientes"
```sql
DROP TABLE IF EXISTS clientes;

CREATE TABLE clientes (  
    id INTEGER PRIMARY KEY AUTOINCREMENT,  
    nome VARCHAR(128) NOT NULL,  
    email VARCHAR(128),  
    telefone VARCHAR(16),  
    morada VARCHAR(128),  
    cidade VARCHAR(32),  
    codigo_postal VARCHAR(10),  
    pais VARCHAR(32),  
    data_registo DATE DEFAULT CURRENT_DATE  
);
```

In [7]:
%%sql
DROP TABLE IF EXISTS clientes;

CREATE TABLE clientes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nome VARCHAR(128) NOT NULL,
    email VARCHAR(128),
    telefone VARCHAR(16),
    morada VARCHAR(128),
    cidade VARCHAR(32),
    codigo_postal VARCHAR(10),
    pais VARCHAR(32),
    data_registo DATE DEFAULT CURRENT_DATE
);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

++
||
++
++

b) Verificar se a tabela existe na base de dados
```sql
SELECT * FROM sqlite_master;
```

```sql
SELECT name FROM sqlite_master WHERE type="clientes";
```

In [8]:
%%sql
SELECT * FROM sqlite_master where name='clientes';

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+-------+----------+----------+----------+--------------------------------------------+
|  type |   name   | tbl_name | rootpage |                    sql                     |
+-------+----------+----------+----------+--------------------------------------------+
| table | clientes | clientes |    2     |          CREATE TABLE clientes (           |
|       |          |          |          |     id INTEGER PRIMARY KEY AUTOINCREMENT,  |
|       |          |          |          |          nome VARCHAR(128) NOT NULL,       |
|       |          |          |          |              email VARCHAR(128),           |
|       |          |          |          |             telefone VARCHAR(16),          |
|       |          |          |          |              morada VARCHAR(128),          |
|       |          |          |          |              cidade VARCHAR(32),           |
|       |          |          |          |           codigo_postal VARCHAR(10),       |
|       |          |          |          |               pais VARCHAR(32),            |
|       |          |          |          |     data_registo DATE DEFAULT CURRENT_DATE |
|       |          |          |          |                     )                      |
+-------+----------+----------+----------+--------------------------------------------+

c) Inserir a informação abaixo no tabela "clientes"
```sql 
INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Ana Silva', 'ana.silva@email.com', '912345678', 'Rua das Flores, 123', 'Madrid', '1000-001', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Carlos Mendes', 'carlos.mendes@email.com', '913456789', 'Av. Central, 45', 'Porto', '4000-200', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Mariana Rocha', 'mariana.rocha@email.com', '914567890', 'Travessa do Sol, 78', 'Coimbra', '3000-150', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('João Costa', 'joao.costa@email.com', '915678901', 'Rua do Mar, 32', 'Faro', '8000-250', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Beatriz Almeida', 'beatriz.almeida@email.com', '916789012', 'Estrada Nacional 1, Km 12', 'Braga', '4700-000', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Ricardo Fonseca', 'ricardo.fonseca@email.com', '917890123', 'Rua das Oliveiras, 56', 'Viseu', '3500-123', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Sofia Matos', 'sofia.matos@email.com', null, 'Largo da Paz, 10', 'Setúbal', '2900-456', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Tiago Carvalho', 'tiago.carvalho@email.com', '919012345', 'Rua do Comércio, 89', 'Aveiro', '3800-789', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Inês Ribeiro', 'ines.ribeiro@email.com', '911234567', 'Alameda dos Oceanos, 101', 'Madrid', '1990-123', 'Portugal');

INSERT INTO Clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Pedro Santos', null, '912345678', 'Rua Nova da Estação, 45', 'Leiria', '2400-100', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Laura Costa', 'laura.costa@email.com', '913456789', 'Av. da Liberdade, 321', 'Guimarães', '4835-123', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Diego Marquez', 'diego21.marque<@email.com', '974567890', 'Calle XXV, 77', 'Barcelona', '989-768', 'Espanha');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Helena Duarte', 'helena.duarte@email.com', '915112233', 'Rua do Limoeiro, 8', null, '2750-642', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, codigo_postal, pais) VALUES
('André Lopes', 'andre.lopes@email.com', '916223344', 'Rua da Escola, 34', '7800-123', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Cláudia Nunes', 'claudia.nunes@email.com', '917334455', 'Av. dos Descobrimentos, 56', null, '9000-100', 'Portugal');
```

In [9]:
%%sql
INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Ana Silva', 'ana.silva@email.com', '912345678', 'Rua das Flores, 123', 'Madrid', '1000-001', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Carlos Mendes', 'carlos.mendes@email.com', '913456789', 'Av. Central, 45', 'Porto', '4000-200', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Mariana Rocha', 'mariana.rocha@email.com', '914567890', 'Travessa do Sol, 78', 'Coimbra', '3000-150', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('João Costa', 'joao.costa@email.com', '915678901', 'Rua do Mar, 32', 'Faro', '8000-250', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Beatriz Almeida', 'beatriz.almeida@email.com', '916789012', 'Estrada Nacional 1, Km 12', 'Braga', '4700-000', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Ricardo Fonseca', 'ricardo.fonseca@email.com', '917890123', 'Rua das Oliveiras, 56', 'Viseu', '3500-123', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Sofia Matos', 'sofia.matos@email.com', null, 'Largo da Paz, 10', 'Setúbal', '2900-456', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Tiago Carvalho', 'tiago.carvalho@email.com', '919012345', 'Rua do Comércio, 89', 'Aveiro', '3800-789', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Inês Ribeiro', 'ines.ribeiro@email.com', '911234567', 'Alameda dos Oceanos, 101', 'Madrid', '1990-123', 'Portugal');

INSERT INTO Clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Pedro Santos', null, '912345678', 'Rua Nova da Estação, 45', 'Leiria', '2400-100', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Laura Costa', 'laura.costa@email.com', '913456789', 'Av. da Liberdade, 321', 'Guimarães', '4835-123', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Diego Marquez', 'diego21.marque<@email.com', '974567890', 'Calle XXV, 77', 'Barcelona', '989-768', 'Espanha');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Helena Duarte', 'helena.duarte@email.com', '915112233', 'Rua do Limoeiro, 8', null, '2750-642', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, codigo_postal, pais) VALUES
('André Lopes', 'andre.lopes@email.com', '916223344', 'Rua da Escola, 34', '7800-123', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Cláudia Nunes', 'claudia.nunes@email.com', '917334455', 'Av. dos Descobrimentos, 56', null, '9000-100', 'Portugal');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

In [10]:
%%sql
SELECT * FROM clientes

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+-----------------+---------------------------+-----------+----------------------------+-----------+---------------+----------+--------------+
| id |       nome      |           email           |  telefone |           morada           |   cidade  | codigo_postal |   pais   | data_registo |
+----+-----------------+---------------------------+-----------+----------------------------+-----------+---------------+----------+--------------+
| 1  |    Ana Silva    |    ana.silva@email.com    | 912345678 |    Rua das Flores, 123     |   Madrid  |    1000-001   | Portugal |  2025-06-30  |
| 2  |  Carlos Mendes  |  carlos.mendes@email.com  | 913456789 |      Av. Central, 45       |   Porto   |    4000-200   | Portugal |  2025-06-30  |
| 3  |  Mariana Rocha  |  mariana.rocha@email.com  | 914567890 |    Travessa do Sol, 78     |  Coimbra  |    3000-150   | Portugal |  2025-06-30  |
| 4  |    João Costa   |    joao.costa@email.com   | 915678901 |       Rua do Mar, 32       |    Faro   |    8000-250   | Portugal |  2025-06-30  |
| 5  | Beatriz Almeida | beatriz.almeida@email.com | 916789012 | Estrada Nacional 1, Km 12  |   Braga   |    4700-000   | Portugal |  2025-06-30  |
| 6  | Ricardo Fonseca | ricardo.fonseca@email.com | 917890123 |   Rua das Oliveiras, 56    |   Viseu   |    3500-123   | Portugal |  2025-06-30  |
| 7  |   Sofia Matos   |   sofia.matos@email.com   |    None   |      Largo da Paz, 10      |  Setúbal  |    2900-456   | Portugal |  2025-06-30  |
| 8  |  Tiago Carvalho |  tiago.carvalho@email.com | 919012345 |    Rua do Comércio, 89     |   Aveiro  |    3800-789   | Portugal |  2025-06-30  |
| 9  |   Inês Ribeiro  |   ines.ribeiro@email.com  | 911234567 |  Alameda dos Oceanos, 101  |   Madrid  |    1990-123   | Portugal |  2025-06-30  |
| 10 |   Pedro Santos  |            None           | 912345678 |  Rua Nova da Estação, 45   |   Leiria  |    2400-100   | Portugal |  2025-06-30  |
| 11 |   Laura Costa   |   laura.costa@email.com   | 913456789 |   Av. da Liberdade, 321    | Guimarães |    4835-123   | Portugal |  2025-06-30  |
| 12 |  Diego Marquez  | diego21.marque<@email.com | 974567890 |       Calle XXV, 77        | Barcelona |    989-768    | Espanha  |  2025-06-30  |
| 13 |  Helena Duarte  |  helena.duarte@email.com  | 915112233 |     Rua do Limoeiro, 8     |    None   |    2750-642   | Portugal |  2025-06-30  |
| 14 |   André Lopes   |   andre.lopes@email.com   | 916223344 |     Rua da Escola, 34      |    None   |    7800-123   | Portugal |  2025-06-30  |
| 15 |  Cláudia Nunes  |  claudia.nunes@email.com  | 917334455 | Av. dos Descobrimentos, 56 |    None   |    9000-100   | Portugal |  2025-06-30  |
+----+-----------------+---------------------------+-----------+----------------------------+-----------+---------------+----------+--------------+

d) Atualizar o campo cidade para "Lisboa" nos registos que apresentam o valor "Madrid" neste mesmo campo

In [11]:
%%sql
-- Contar o número de clientes na cidade de Madrid
SELECT COUNT(*) AS "Clientes Madrid"
FROM clientes
WHERE cidade='Madrid'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+-----------------+
| Clientes Madrid |
+-----------------+
|        2        |
+-----------------+

In [12]:
%%sql
UPDATE clientes SET cidade='Lisboa', pais='Portugal' 
WHERE cidade = 'Madrid';

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

2 rows affected.

++
||
++
++

In [13]:
%%sql
SELECT * FROM clientes WHERE id in (1, 9);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+--------------+------------------------+-----------+--------------------------+--------+---------------+----------+--------------+
| id |     nome     |         email          |  telefone |          morada          | cidade | codigo_postal |   pais   | data_registo |
+----+--------------+------------------------+-----------+--------------------------+--------+---------------+----------+--------------+
| 1  |  Ana Silva   |  ana.silva@email.com   | 912345678 |   Rua das Flores, 123    | Lisboa |    1000-001   | Portugal |  2025-06-30  |
| 9  | Inês Ribeiro | ines.ribeiro@email.com | 911234567 | Alameda dos Oceanos, 101 | Lisboa |    1990-123   | Portugal |  2025-06-30  |
+----+--------------+------------------------+-----------+--------------------------+--------+---------------+----------+--------------+

e) Eliminar os registos apresentam o valor "Barcelona" no campo cidade ou não têm qualquer valor no campo cidade

In [14]:
%%sql
-- Verificar quantos registo serão eliminados
SELECT nome, cidade FROM clientes 
WHERE 
    cidade = 'Barcelona' OR
    cidade IS NULL

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+---------------+-----------+
|      nome     |   cidade  |
+---------------+-----------+
| Diego Marquez | Barcelona |
| Helena Duarte |    None   |
|  André Lopes  |    None   |
| Cláudia Nunes |    None   |
+---------------+-----------+

In [15]:
%%sql
DELETE FROM clientes 
WHERE 
    cidade = 'Barcelona' OR
    cidade IS NULL

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

4 rows affected.

++
||
++
++

---

In [16]:
%%sql
-- Adicionar novos clientes
INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Diego Marquez', 'diego21.marque<@email.com', '974567890', 'Calle XXV, 77', 'Barcelona', '989-768', 'Espanha');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Helena Duarte', 'helena.duarte@email.com', '915112233', 'Rua do Limoeiro, 8', null, '2750-642', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, codigo_postal, pais) VALUES
('André Lopes', 'andre.lopes@email.com', '916223344', 'Rua da Escola, 34', '7800-123', 'Portugal');

INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Cláudia Nunes', 'claudia.nunes@email.com', '917334455', 'Av. dos Descobrimentos, 56', null, '9000-100', 'Portugal');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

f) Listar o identificador e nome dos clientes que residem em Leiria

In [17]:
%%sql
SELECT id, nome FROM clientes
WHERE
    cidade = 'Leiria'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+--------------+
| id |     nome     |
+----+--------------+
| 10 | Pedro Santos |
+----+--------------+

g) Listar o nome dos clientes que não têm email ou telefone definidos

In [18]:
%%sql
SELECT nome, email, telefone FROM clientes
WHERE
    email IS NULL OR
    telefone IS NULL

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+--------------+-----------------------+-----------+
|     nome     |         email         |  telefone |
+--------------+-----------------------+-----------+
| Sofia Matos  | sofia.matos@email.com |    None   |
| Pedro Santos |          None         | 912345678 |
+--------------+-----------------------+-----------+

h) Listar o numero, nome e cidades dos clientes que têm apelido "Silva"

In [19]:
%%sql
SELECT nome, telefone FROM clientes
WHERE
    nome LIKE '%Silva'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+-----------+-----------+
|    nome   |  telefone |
+-----------+-----------+
| Ana Silva | 912345678 |
+-----------+-----------+

In [20]:
%%sql
-- forma mais robusta
SELECT nome, telefone FROM clientes
WHERE
    UPPER(TRIM(nome)) LIKE '%SILVA'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+-----------+-----------+
|    nome   |  telefone |
+-----------+-----------+
| Ana Silva | 912345678 |
+-----------+-----------+

g) Calcular a quantidade de clientes que residem em Madrid » Lisboa

In [21]:
%%sql
SELECT COUNT(id) as "Residentes em Madrid" FROM clientes
WHERE
    cidade = 'Lisboa'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----------------------+
| Residentes em Madrid |
+----------------------+
|          2           |
+----------------------+

h) Calcular a quantidade de clientes de Portugal

In [22]:
%%sql
SELECT COUNT(id) as "Residentes em Madrid" FROM clientes
WHERE
    pais = 'Portugal'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----------------------+
| Residentes em Madrid |
+----------------------+
|          14          |
+----------------------+

i) Calcular a quantidade de clientes cujo código postal começa por `9`

In [23]:
%%sql
SELECT nome, codigo_postal FROM clientes
WHERE
    codigo_postal LIKE '9%'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+---------------+---------------+
|      nome     | codigo_postal |
+---------------+---------------+
| Diego Marquez |    989-768    |
| Cláudia Nunes |    9000-100   |
+---------------+---------------+

j) Inserir o seguinte registo na tabela `clientes`.

```sql
INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Roberto Abreu', 'ro.ab@email.com', '921234567', 'Av. Principal, 101B', null, '5400-100', 'Portugal');
```

In [24]:
%%sql
INSERT INTO clientes (nome, email, telefone, morada, cidade, codigo_postal, pais)
VALUES ('Roberto Abreu', 'ro.ab@email.com', '921234567', 'Av. Principal, 101B', null, '5400-100', 'Portugal');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

++
||
++
++

k) Alterar a cidade no registo anterior para `chaves`

In [25]:
%%sql
-- Verificar o último ID inserido
SELECT MAX(id) AS "Último registo" FROM clientes;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----------------+
| Último registo |
+----------------+
|       20       |
+----------------+

In [26]:
%%sql
-- Para confirmar que o último ID é o correto 
SELECT nome, email, telefone FROM clientes
WHERE 
id = (SELECT id FROM clientes WHERE email = 'ro.ab@email.com');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+---------------+-----------------+-----------+
|      nome     |      email      |  telefone |
+---------------+-----------------+-----------+
| Roberto Abreu | ro.ab@email.com | 921234567 |
+---------------+-----------------+-----------+

In [27]:
%%sql
UPDATE clientes
SET cidade = 'Chaves'
WHERE id = (SELECT id FROM clientes WHERE email = 'ro.ab@email.com');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

++
||
++
++

In [28]:
%%sql
SELECT nome, email, telefone, cidade FROM clientes
WHERE 
id = (SELECT id FROM clientes WHERE email = 'ro.ab@email.com');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+---------------+-----------------+-----------+--------+
|      nome     |      email      |  telefone | cidade |
+---------------+-----------------+-----------+--------+
| Roberto Abreu | ro.ab@email.com | 921234567 | Chaves |
+---------------+-----------------+-----------+--------+

l) Eliminar todos os registos da tabela `clientes` com a cidade `chaves`

In [29]:
%%sql
-- verificar quantos registo vão ser afetados
SELECT COUNT(*) FROM clientes
WHERE cidade = 'Chaves';

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----------+
| COUNT(*) |
+----------+
|    1     |
+----------+

In [30]:
%%sql
DELETE FROM clientes
WHERE
    cidade = 'Chaves'

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

++
||
++
++

m) Determinar a quantidade de clientes de cada país

In [31]:
%%sql
-- lista os paises distintos
SELECT DISTINCT pais AS "Países Distintos" FROM clientes;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+------------------+
| Países Distintos |
+------------------+
|     Portugal     |
|     Espanha      |
+------------------+

In [32]:
%%sql
-- Conta quantos paises diferentes existem
SELECT COUNT(DISTINCT pais) AS "Número de Países Distintos" FROM clientes;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----------------------------+
| Número de Países Distintos |
+----------------------------+
|             2              |
+----------------------------+

In [33]:
%%sql
-- Conta quantos clientes existem por país
SELECT pais, COUNT(id) as "Número de Clientes"
FROM clientes
GROUP BY pais
ORDER BY "Número de Clientes" DESC;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----------+--------------------+
|   pais   | Número de Clientes |
+----------+--------------------+
| Portugal |         14         |
| Espanha  |         1          |
+----------+--------------------+

n) Determinar a quantidade de clientes de cada cidade e ordenar pela contagem efetuada (colocando as cidades com mais clientes no inicio dos resultados)

In [34]:
%%sql
SELECT cidade, COUNT(id) AS "Número de Clientes"
FROM clientes
WHERE cidade IS NOT NULL
GROUP BY cidade
ORDER BY "Número de Clientes" DESC

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+-----------+--------------------+
|   cidade  | Número de Clientes |
+-----------+--------------------+
|   Lisboa  |         2          |
|   Viseu   |         1          |
|  Setúbal  |         1          |
|   Porto   |         1          |
|   Leiria  |         1          |
| Guimarães |         1          |
|    Faro   |         1          |
|  Coimbra  |         1          |
|   Braga   |         1          |
| Barcelona |         1          |
|   Aveiro  |         1          |
+-----------+--------------------+

In [35]:
%%sql
SELECT cidade, COUNT(id) AS "Número de Clientes"
FROM clientes
WHERE cidade IS NOT NULL
GROUP BY cidade
ORDER BY "Número de Clientes" DESC, cidade DESC
LIMIT 5;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+---------+--------------------+
|  cidade | Número de Clientes |
+---------+--------------------+
|  Lisboa |         2          |
|  Viseu  |         1          |
| Setúbal |         1          |
|  Porto  |         1          |
|  Leiria |         1          |
+---------+--------------------+

---

## Tabela *Categorias*

a) Definir a tabela `categorias`
```sql
DROP TABLE IF EXISTS categorias;
CREATE TABLE categorias (
    id_categoria INTEGER PRIMARY KEY AUTOINCREMENT,
    nome TEXT NOT NULL
);
```

In [36]:
%%sql
DROP TABLE IF EXISTS categorias;
CREATE TABLE categorias (
    id_categoria INTEGER PRIMARY KEY AUTOINCREMENT,
    nome TEXT NOT NULL
);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

++
||
++
++

b) Popular a tabela `categorias`
```sql
INSERT INTO categorias (nome) VALUES ('Eletrónica');
INSERT INTO categorias (nome) VALUES ('Roupa');
INSERT INTO categorias (nome) VALUES ('Calçado');
INSERT INTO categorias (nome) VALUES ('Móveis');
```

In [37]:
%%sql
INSERT INTO categorias (nome) VALUES ('Eletrónica');
INSERT INTO categorias (nome) VALUES ('Roupa');
INSERT INTO categorias (nome) VALUES ('Calçado');
INSERT INTO categorias (nome) VALUES ('Móveis');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

---

# Tabela fornecedores

a) Definir a tabela `fornecedores`  
```sql
DROP TABLE IF EXISTS fornecedores;

CREATE TABLE fornecedores (  
    id_fornecedor INTEGER PRIMARY KEY AUTOINCREMENT,  
    nome VARCHAR(50) NOT NULL,   
    endereco VARCHAR(128),  
    cidade VARCHAR(20),  
    pais   VARCHAR(30),  
    telefone VARCHAR(16),  
    email VARCHAR(30)  
);
```

In [38]:
%%sql
DROP TABLE IF EXISTS fornecedores;

CREATE TABLE fornecedores (  
    id_fornecedor INTEGER PRIMARY KEY AUTOINCREMENT,  
    nome VARCHAR(50) NOT NULL,   
    endereco VARCHAR(128),  
    cidade VARCHAR(20),  
    pais   VARCHAR(30),  
    telefone VARCHAR(16),  
    email VARCHAR(30)  
);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

++
||
++
++

b) Popular a tabela `fornecedores` 

```sql
INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Tech Solutions', 'Av. Paulista, 1000', 'São Paulo', 'Brasil', '+55 11 98765-4321', 'contato@techsolutions.com');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Global Supplies', '123 Main St', 'New York', 'EUA', '+1 212-555-7890',   'sales@globalsupplies.com');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('ElectroParts', 'Calle Mayor, 45', 'Madrid', 'Espanha', '+34 91 123 4567', 'info@electroparts.es');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('MegaCom', 'Rua das Flores, 500', 'Lisboa', 'Portugal', '+351 21 456 7890', 'support@megacom.pt');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Fast Logistics', 'Jalan Sudirman, 12', 'Jacarta', 'Indonésia', '+62 21 8765 4321', 'contact@fastlogistics.co.id');
```

In [39]:
%%sql
INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Tech Solutions', 'Av. Paulista, 1000', 'São Paulo', 'Brasil', '+55 11   98765-4321', 'contato@techsolutions.com');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)   
VALUES ('Global Supplies', '123 Main St', 'New York', 'EUA', '+1 212-555-7890',   'sales@globalsupplies.com');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)   
VALUES ('ElectroParts', 'Calle Mayor, 45', 'Madrid', 'Espanha', '+34 91 123   4567', 'info@electroparts.es');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)   
VALUES ('MegaCom', 'Rua das Flores, 500', 'Lisboa', 'Portugal', '+351 21 456   7890', 'support@megacom.pt');

INSERT INTO fornecedores (nome, endereco, cidade, pais, telefone, email)
VALUES ('Fast Logistics', 'Jalan Sudirman, 12', 'Jacarta', 'Indonésia', '+62 21   8765 4321', 'contact@fastlogistics.co.id');

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

---

# Tabela produtos

```sql
DROP TABLE IF EXISTS produtos;

CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY,
    nome TEXT,
    preco REAL,
    unidades INTEGER,
    id_categoria INTEGER NOT NULL, 
    id_fornecedor INTEGER NOT NULL,
    FOREIGN KEY (id_categoria) REFERENCES categorias(id_categoria),
    FOREIGN KEY (id_fornecedor) REFERENCES Fornecedores(id_fornecedor)
);
```

In [40]:
%%sql
DROP TABLE IF EXISTS produtos;

CREATE TABLE IF NOT EXISTS produtos (  
    id INTEGER PRIMARY KEY,
    nome TEXT,
    preco REAL,
    unidades INTEGER,
    id_categoria INTEGER NOT NULL, 
    id_fornecedor INTEGER NOT NULL,
    FOREIGN KEY (id_categoria) REFERENCES categorias(id_categoria),
    FOREIGN KEY (id_fornecedor) REFERENCES Fornecedores(id_fornecedor)
);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

++
||
++
++

In [41]:
%%sql
SELECT * FROM categorias;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+--------------+------------+
| id_categoria |    nome    |
+--------------+------------+
|      1       | Eletrónica |
|      2       |   Roupa    |
|      3       |  Calçado   |
|      4       |   Móveis   |
+--------------+------------+

```sql
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Sandálias Verão',       39.90,  50, 3, 2);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('T-Shirt básica',        14.99, 100, 2, 3);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Calças Jeans',          49.90,  40, 2, 3);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Casaco de Inverno',     89.00,  25, 2, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Televisão 50"',        499.99,  10, 1, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Sistema de Som',       259.00,  20, 1, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Coluna Bluetooth',      69.90,  35, 1, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Portátil Dell',        899.00,  12, 1, 1);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Rato Sem Fios',         24.50,  60, 1, 2);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Monitor 27"',          199.90,  18, 1, 5);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('iPhone 14',           1149.00,   8, 1, 1);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Samsung Galaxy S23',   999.00,  10, 1, 1);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Xiaomi Redmi Note 12', 249.90,  25, 1, 4);
```

In [42]:
%%sql
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Sandálias Verão',       39.90,  50, 3, 2);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('T-Shirt básica',        14.99, 100, 2, 3);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Calças Jeans',          49.90,  40, 2, 3);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Casaco de Inverno',     89.00,  25, 2, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Televisão 50"',        499.99,  10, 1, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Sistema de Som',       259.00,  20, 1, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Coluna Bluetooth',      69.90,  35, 1, 4);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Portátil Dell',        899.00,  12, 1, 1);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Rato Sem Fios',         24.50,  60, 1, 2);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Monitor 27"',          199.90,  18, 1, 5);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('iPhone 14',           1149.00,   8, 1, 1);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Samsung Galaxy S23',   999.00,  10, 1, 1);
INSERT INTO produtos (nome, preco, unidades, id_categoria,id_fornecedor) VALUES ('Xiaomi Redmi Note 12', 249.90,  25, 1, 4);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

---

## Tabela `Vendas`

a) Definição da tabela "Vendas"  
  
    >Ativar a opção das chaves estrangeiras:
```sql
PRAGMA foreign_keys = ON;
```
    > Criar a tabela "Produtos" caso ainda não exista

    > 
    
```sql
DROP TABLE IF EXISTS vendas;

CREATE TABLE vendas (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cliente_id INTEGER,
    produto_id INTEGER,
    quantidade INTEGER NOT NULL,
    data_venda DATE DEFAULT CURRENT_DATE,
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
);
  ```

In [43]:
%%sql
DROP TABLE IF EXISTS vendas;

CREATE TABLE vendas (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cliente_id INTEGER,
    produto_id INTEGER,
    quantidade INTEGER NOT NULL,
    data_venda DATE DEFAULT CURRENT_DATE,
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

++
||
++
++

b) Inserir a informação abaixo na tabela "Vendas"  
```sql
INSERT INTO vendas (cliente_id, produto_id, quantidade) VALUES  
    (1, 1, 2),
    (2, 3, 1),
    (3, 5, 3),
    (4, 7, 1),
    (5, 8, 2),
    (6, 9, 1),
    (6, 1, 1),
    (7, 10, 5),
    (8, 12, 4),
    (9, 13, 3),
    (10, 2, 2),
    (10, 1, 5);
```

In [44]:
%%sql
INSERT INTO vendas (cliente_id, produto_id, quantidade) VALUES  
    (1, 1, 2),
    (2, 3, 1),
    (3, 5, 3),
    (4, 7, 1),
    (5, 8, 2),
    (6, 9, 1),
    (6, 1, 1),
    (7, 10, 5),
    (8, 12, 4),
    (9, 13, 3),
    (10, 2, 2),
    (10, 1, 5);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

12 rows affected.

++
||
++
++

c) Calcular quantas vendas efetuou o cliente nº1

In [60]:
%%sql
-- O que sabemos do cliente com id = 1?
SELECT * FROM clientes WHERE id = 1;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+-----------+---------------------+-----------+---------------------+--------+---------------+----------+--------------+
| id |    nome   |        email        |  telefone |        morada       | cidade | codigo_postal |   pais   | data_registo |
+----+-----------+---------------------+-----------+---------------------+--------+---------------+----------+--------------+
| 1  | Ana Silva | ana.silva@email.com | 912345678 | Rua das Flores, 123 | Lisboa |    1000-001   | Portugal |  2025-06-30  |
+----+-----------+---------------------+-----------+---------------------+--------+---------------+----------+--------------+

In [61]:
%%sql
-- Resposta com recurso a SUBQUERIES
SELECT nome
FROM produtos
WHERE id in (
    SELECT produto_id FROM vendas WHERE cliente_id = (
        SELECT id FROM clientes WHERE nome = 'Ana Silva'
    )
);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+-----------------+
|       nome      |
+-----------------+
| Sandálias Verão |
+-----------------+

c.extra) Calcular quantas vendas efetuou o cliente nº10

In [62]:
%%sql
-- Calcular quantas vendas efetuou o cliente nº10
SELECT COUNT(*) AS "Número de Vendas"
FROM vendas
WHERE cliente_id = 10;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+------------------+
| Número de Vendas |
+------------------+
|        2         |
+------------------+

d) Determinar os nomes dos clientes que compraram o produto com o id "1"

In [65]:
%%sql
-- Verificação prévia: O que sabemos do produto com id = 1
SELECT * FROM produtos WHERE id = 1;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+-----------------+-------+----------+--------------+---------------+
| id |       nome      | preco | unidades | id_categoria | id_fornecedor |
+----+-----------------+-------+----------+--------------+---------------+
| 1  | Sandálias Verão |  39.9 |    50    |      3       |       2       |
+----+-----------------+-------+----------+--------------+---------------+

In [68]:
%%sql
-- Verificação prévia: O que sabemos da tabela de clientes
SELECT * FROM clientes LIMIT 0;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+------+-------+----------+--------+--------+---------------+------+--------------+
| id | nome | email | telefone | morada | cidade | codigo_postal | pais | data_registo |
+----+------+-------+----------+--------+--------+---------------+------+--------------+
+----+------+-------+----------+--------+--------+---------------+------+--------------+

In [69]:
%%sql
-- Verificação prévia: O que sabemos da tabela vendas
SELECT * FROM vendas WHERE id = 1;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+------------+------------+------------+------------+
| id | cliente_id | produto_id | quantidade | data_venda |
+----+------------+------------+------------+------------+
| 1  |     1      |     1      |     2      | 2025-06-30 |
+----+------------+------------+------------+------------+

In [67]:
%%sql
-- Verificação prévia: O que sabemos da tabela de produtos
SELECT * FROM produtos LIMIT 0;

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+----+------+-------+----------+--------------+---------------+
| id | nome | preco | unidades | id_categoria | id_fornecedor |
+----+------+-------+----------+--------------+---------------+
+----+------+-------+----------+--------------+---------------+

In [70]:
%%sql
-- Determinar os nomes dos clientes que compraram o produto com o id = 1
SELECT nome FROM clientes WHERE id IN (
    SELECT cliente_id FROM vendas WHERE produto_id = 1
);

Running query in 'sqlite:///Exercicio_Clientes.sqlite'

+-----------------+
|       nome      |
+-----------------+
|    Ana Silva    |
| Ricardo Fonseca |
|   Pedro Santos  |
+-----------------+

e) Determinar os nomes dos produtos comprados pelo cliente com o id "1"


f) Determinar os países  dos clientes que compraram o produto "Calças Jeans"

g) Determinar o *id* do produto com mais vendas

h) Determinar o *id* do produto com maiores quantidades vendidas

i) Calcular o número de compras de cada cliente

j) Apresentar o número de compras de cada cliente, mas só apresentar os clientes com mais de 2 compras

k) Determinar o número de vendas dos produtos vendidos

l) Determinar o número de vendas dos produtos vendidos, mas só apresentar os produtos com mais de 4 vendas